wiki/20180310-linux-command-tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux command tips</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">linux command tips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44e50df">1. nl</a></li>
<li><a href="#org167366e">2. xmllint</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-left">modification</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">20180310</td>
<td class="org-left">add nl, xmllint</td>
</tr>
</tbody>
</table>

<p>
最近发现了一些挺有意思的小命令；虽然比较“旁门左道”，用到时还是挺不错的。
</p>
<div id="outline-container-org44e50df" class="outline-2">
<h2 id="org44e50df"><span class="section-number-2">1</span> nl</h2>
<div class="outline-text-2" id="text-1">
<p>
nl is short of "line number filter",专用用来给文件“按照指定规则标记行号”的小工具。
比如空行跳过、行号宽度、只对“匹配正则表达式”的行进行标记。
</p>

<p>
详细参考：
</p>
<ul class="org-ul">
<li><a href="http://www.cnblogs.com/peida/archive/2012/11/01/2749048.html">http://www.cnblogs.com/peida/archive/2012/11/01/2749048.html</a></li>
<li>man nl（macos 自带了这个命令。）</li>
</ul>
</div>
</div>

<div id="outline-container-org167366e" class="outline-2">
<h2 id="org167366e"><span class="section-number-2">2</span> xmllint</h2>
<div class="outline-text-2" id="text-2">
<p>
xmllint是一个针对 xml 进行格式解析、处理的工具。
详细参考：
</p>
<ul class="org-ul">
<li><a href="http://www.361way.com/xmllint-html-xml/3048.html">http://www.361way.com/xmllint-html-xml/3048.html</a></li>
<li>man xmllint(macos 自带了这个命令)</li>
</ul>
</div>
</div>
</div>
</body>
</html>
